cf/InformationRegisters/BookkeepingPostingSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>BookkeepingPostingSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>BookkeepingPostingType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BookkeepingPostingTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/BookkeepingPostingTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>BookkeepingPostingTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OnPosting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Delayed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DontPost</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/CodeTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>CodeTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DontShow</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Code</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Article</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EANCode</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/BookkeepingOperation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>BookkeepingOperation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.VATRegisterPurchase</xr:Item>
				<xr:Item>AccountingRegister.Bookkeeping</xr:Item>
				<xr:Item>InformationRegister.DocumentHierarchy</xr:Item>
				<xr:Item>AccumulationRegister.VATRegisterSales</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.DocumentAuthor</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BookkeepingOperationsTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BookkeepingOperationsTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Company</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Currency</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentBase</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ExchangeRate</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupRecords</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InitialDocumentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InitialDocumentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Manual</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationTypesBookkeepingOperation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartialJournal</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Records</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Bookkeeping</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Quantity</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Currency</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CurrencyAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountDr</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCr</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.BookkeepingOperationRecordTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RequestedParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SalesVATRecords</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATSalesDocument</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NetAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Partner</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATCustomer</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VAT</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATRate</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.BookkeepingOperationRecordTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PurchaseVATRecords</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATPurchaseDocument</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NetAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Partner</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATCustomer</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VAT</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATRate</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.BookkeepingOperationRecordTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/DialogsAtServer/Ext/Module.bsl
Procedure CheckAccountsExtDimensions(Account, ExtDimensionName = "ExtDimension", Object) Export 
	
	MaxExtraDimension = Metadata.ChartsOfAccounts.Bookkeeping.MaxExtDimensionCount;
	
	//??? reset values
	If Not ValueIsFilled(Account) Then
		ExtDimension1 = Undefined;
		ExtDimension2 = Undefined;
		ExtDimension3 = Undefined;
	EndIf;
	
	// set fields type and change labels
	For Counter = 1 To MaxExtraDimension Do
		
		If Not ValueIsFilled(Account) Or Counter > Account.ExtDimensionTypes.Count() Then
			
			If ValueIsFilled(Object[ExtDimensionName + Counter]) Then
				Object[ExtDimensionName + Counter] = Undefined;
			EndIf;
			
		Else
			ExtDimensionType = Account.ExtDimensionTypes[Counter-1].ExtDimensionType;
			ExtDimensionTypesDescription = ExtDimensionType.ValueType;
			Object[ExtDimensionName + Counter] = ExtDimensionTypesDescription.AdjustValue(Object[ExtDimensionName + Counter]);
			
		EndIf;
		
	EndDo;
	
EndProcedure



Function GetBookkeepingOperation(DocumentRef) Export 
	Answer = New Structure("Success,Message,ShowMessage,BookkeepingOperation,Empty",False,"",False,Undefined,False);
	BookkeepingIsRegisterRecords = FALSE;
	
	MetadataDocument = Metadata.Documents[DocumentRef.Metadata().Name];
	
	For each RegisterRecords in MetadataDocument.RegisterRecords do
		If Metadata.AccountingRegisters.Bookkeeping = RegisterRecords Then
			BookkeepingIsRegisterRecords = TRUE;
			Break;
		EndIf;

	EndDo;
	
	// If base document is BO
	If TypeOf(DocumentRef) = TypeOf(Documents.BookkeepingOperation.EmptyRef()) or BookkeepingIsRegisterRecords = TRUE   Then
		Return Answer;		
	ElsIf BookkeepingIsRegisterRecords = FALSE Then
		
		Query = New Query;
		
		Query.Text = "SELECT
		             |	BookkeepingOperation.Ref AS BookkeepingOperation
		             |FROM
		             |	Document.BookkeepingOperation AS BookkeepingOperation
		             |WHERE
		             |	BookkeepingOperation.DocumentBase = &ReportsDocument";		
		Query.SetParameter("ReportsDocument",DocumentRef);
		QueryResult = Query.Execute();
		If QueryResult.IsEmpty() Then
			// 	There is no BO
			RecordKey = InformationRegisters.BookkeepingPostingSettings.Get(New Structure("Object",New (TypeOf(DocumentRef))));
			BookkeepingPostingType = RecordKey.BookkeepingPostingType;
			If NOT DocumentRef.Posted Then
				Answer.ShowMessage = True;
				Answer.Message = NStr("en = 'This document was not posted. Unposted document could not have no bookkeeping operation.'; pl = 'Ten dokument nie został zatwierdzony. Nie zatwierdzony document nie może posiadać DK.'")
			ElsIf BookkeepingPostingType = Enums.BookkeepingPostingTypes.DontPost Then	
				Answer.ShowMessage = True;
				Answer.Message = NStr("en = 'This document could not be bookkeeping posted. Please check your bookkeeping posting settings.'; pl = 'Ten dokument nie może być zaksięgowany. Sprawdź ustawienia księgowania.'");				
			Else	
				If AccessRight("Posting",Metadata.Documents.BookkeepingOperation) Then
					Answer.Empty = True;
				Else	
					Answer.ShowMessage = True;
					Answer.Message = NStr("en = 'For this document bookkeeping operation does not exists. You don''t have enough permissions to create a new one!'; pl = 'Na podstawie tego dokumentu nie został zaksięgowany dowód księgowy. Nie masz wystarczająco uprawnień aby stworzyć lub zaksięgować nowy!'");					
				EndIf;	
			EndIf;
		Else
			// BO is found, open it
			Selection = QueryResult.Select();
			Selection.Next();
			Answer.Success = True;
			Answer.BookkeepingOperation = Selection.BookkeepingOperation;
		EndIf;	
				
	EndIf;
	
	Return Answer;
		
EndFunction


Procedure AddDocumentTabularPartCodeColumn(ThisForm) Export
	Object = ThisForm.Object;
	//  by Jack 28.03.2017
	//CodeType = CommonAtServer.GetUserSettingsValue(ChartsOfCharacteristicTypes.UserSettings.ShowItemCodeInDocument, SessionParameters.CurrentUser);
	CodeType = Enums.CodeTypes.DontShow;

	AllItems = ThisForm.Items;
	ObjectMetadata = Object.Ref.Metadata();
	ItemType = Type("CatalogRef.Items");
	If ValueIsFilled(CodeType) AND CodeType <> Enums.CodeTypes.DontShow Then
		For Each TabularPart In ObjectMetadata.TabularSections Do
			ParentItem = AllItems.Find(TabularPart.Name);			
			If ParentItem <> Undefined Then			
				For Each CurrentAttribute In TabularPart.Attributes Do							
					If CurrentAttribute.Type.ContainsType(ItemType) AND CurrentAttribute.Type.Types().Count() = 1 Then
						CodeColumn = AllItems.Insert(TabularPart.Name + "GeneratedCodeColumn", Type("FormField"), ParentItem, AllItems[TabularPart.Name + CurrentAttribute.Name]);
						AllItems.Move(AllItems[TabularPart.Name + CurrentAttribute.Name], AllItems[TabularPart.Name] , CodeColumn);
						CodeColumn.Type = FormFieldType.InputField;
						CodeColumn.ReadOnly = True;
						CodeColumn.Visible = True;
						CodeColumn.Width = 20;
						
						If CodeType = Enums.CodeTypes.Code Then				
							AttributeName = "Code";
						ElsIf CodeType = Enums.CodeTypes.Article Then
							AttributeName = "Article";
						ElsIf CodeType = Enums.CodeTypes.EANCode Then
							AttributeName = "MainBarCode";
						EndIf;
						
						CodeColumn.DataPath = "Object." + TabularPart.Name + "." + CurrentAttribute.Name + "." + AttributeName;
					EndIf;				
				EndDo;			
			EndIf; 
		EndDo;
	EndIf;
	
EndProcedure
